## **DATA PROFILING & ANALYSIS / MAVEN FUZZY FACTORY**

In [17]:
import configparser

config = configparser.ConfigParser()
config.read('db.ini')
config.sections()

host = config['DEFAULT']['MYSQL_HOST']
port = int(config['DEFAULT']['MYSQL_PORT'])
user = config['DEFAULT']['MYSQL_USER']
pswd = config['DEFAULT']['MYSQL_PWD']
db = config['DEFAULT']['MYSQL_DB']

In [2]:
import sqlalchemy
from sqlalchemy.engine.url import URL
import pandas as pd

engine = sqlalchemy.create_engine(f"mysql+mysqlconnector://{user}:{pswd}@{host}:{port}/{db}", pool_pre_ping=True)

%load_ext sql
%sql mysql+mysqlconnector://{user}:{pswd}@{host}:{port}/{db}
%config SqlMagic.autolimit = 20  # head(20)
# %config SqlMagic.displaylimit = 20 # chunk of 20 rows(mixed of head & tail)
# %config SqlMagic.style = 'PLAIN_COLUMNS' 
%config SqlMagic.autopandas = True
%config SqlMagic.feedback = True

<center>
<h3><b>MAVEN FUZZY FACTORY ER-DIAGRAM</b></h3> 
<img src="assets/MavenFuzzyFactory_ER_diagram.png">

    
</center>

In [3]:
%%sql 
SELECT DISTINCT  
    utm_source
FROM website_sessions

 * mysql+mysqlconnector://root:***@localhost:3306/mavenfuzzyfactory
4 rows affected.

   utm_source
0     gsearch
1        None
2     bsearch
3  socialbook

<h3><b>ANALYZING TRAFFIC SOURCES</b></h3> 

Analyzing the source channels(__where the customers come from?__) and the traffic volume and conversion rates(__which channels drive the highest traffic?__) to adjust Marketing business. This analysis includes the use of the UTM params to identify the difference between paid/unpaid source session in order to get insigths of how much revenue the paid campaigns are driving. 
#### Key Tables:
`website_sessions` ; 
`website_pageviews` ;
`orders`

In [4]:
%%sql   # No. of sessions initiated per each session source
SELECT
    utm_content,
    COUNT(DISTINCT website_session_id) AS sessions 
FROM 
    website_sessions 
GROUP BY 
    utm_content 
ORDER BY 
    sessions DESC

 * mysql+mysqlconnector://root:***@localhost:3306/mavenfuzzyfactory
7 rows affected.

   utm_content  sessions
0       g_ad_1    282706
1         None     83328
2       b_ad_1     54909
3       g_ad_2     33329
4       b_ad_2      7914
5  social_ad_2      5590
6  social_ad_1      5095

In [5]:
%%sql    # What is the percentage of Sessions converted to Revenue per source? -> `Conversion Rate(CVR)`
SELECT
    W.utm_content,
    COUNT(DISTINCT W.website_session_id) AS sessions, 
    COUNT(DISTINCT O.order_id) AS orders, 
    COUNT(DISTINCT O.order_id)/COUNT(DISTINCT W.website_session_id)*100 AS 'conversion rate - %'
FROM website_sessions W
    LEFT JOIN orders O 
        ON O.website_session_id = W.website_session_id
GROUP BY 
    W.utm_content, 
    W.utm_campaign
ORDER BY 
    sessions DESC

 * mysql+mysqlconnector://root:***@localhost:3306/mavenfuzzyfactory
7 rows affected.

   utm_content  sessions  orders conversion rate - %
0       g_ad_1    282706   18822              6.6578
1         None     83328    6118              7.3421
2       b_ad_1     54909    3818              6.9533
3       g_ad_2     33329    2511              7.5340
4       b_ad_2      7914     701              8.8577
5  social_ad_2      5590     288              5.1521
6  social_ad_1      5095      55              1.0795

<hr>
<h4><b>ASCERTAIN TOP TRAFFIC BY UTM TRACKER PARAMETERS</b></h4>
    
<img src="assets/ass-01.png" width="400" height="300">

<hr>

In [18]:
%%sql   
SELECT
    W.utm_content,
    W.utm_source,
    W.utm_campaign,
    W.http_referer,
    COUNT(DISTINCT W.website_session_id) AS session_count
FROM website_sessions W
WHERE 
    W.created_at < '2012-04-12'
GROUP BY 
    W.utm_content, 
    W.utm_source,
    W.utm_campaign,
    W.http_referer
ORDER BY 
    session_count DESC

 * mysql+mysqlconnector://root:***@localhost:3306/mavenfuzzyfactory
6 rows affected.

  utm_content utm_source utm_campaign             http_referer  session_count
0      g_ad_1    gsearch     nonbrand  https://www.gsearch.com           3613
1        None       None         None                     None             28
2        None       None         None  https://www.gsearch.com             27
3      g_ad_2    gsearch        brand  https://www.gsearch.com             26
4        None       None         None  https://www.bsearch.com              7
5      b_ad_2    bsearch        brand  https://www.bsearch.com              7

In [19]:
%%sql   # Dive deeper by comparing brand and nonbrand campaign at some point of time
SELECT
    W.utm_campaign,
    COUNT(DISTINCT W.website_session_id) AS session_count
FROM website_sessions W
WHERE 
    W.created_at < '2012-04-12' AND 
    W.utm_source = 'gsearch' AND 
    (W.utm_campaign = 'nonbrand'OR 
     W.utm_campaign = 'brand' OR 
     W.utm_campaign = 'None')
GROUP BY
    W.utm_campaign
ORDER BY 
    session_count DESC

 * mysql+mysqlconnector://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

  utm_campaign  session_count
0     nonbrand           3613
1        brand             26

<hr>
<h4><b>CONVERSION RATE(CVR)</b></h4>

<img src="assets/ass-02.png" width="400" height="300">

<hr>

In [20]:
%%sql     # CVR from Session -> Order below shows an outcome less than 4%
SELECT
    COUNT(DISTINCT W.website_session_id) AS sessions, 
    COUNT(DISTINCT O.order_id) AS orders, 
    COUNT(DISTINCT O.order_id)/COUNT(DISTINCT W.website_session_id)*100 AS conversion_rate
FROM website_sessions W
    LEFT JOIN orders O 
        ON O.website_session_id = W.website_session_id
WHERE W.created_at < '2012-04-14' 
    AND W.utm_source = 'gsearch' 
    AND W.utm_campaign = 'nonbrand'

 * mysql+mysqlconnector://root:***@localhost:3306/mavenfuzzyfactory
1 rows affected.

   sessions  orders conversion_rate
0      3895     112          2.8755

#### **# USE OF `DATE` RELATED FUNCTIONS**

In [21]:
%%sql   
SELECT 
    YEAR(created_at) as year,
    WEEK(created_at) as week,
    MIN(DATE(created_At)) as week_start,
    COUNT(DISTINCT website_session_id) AS session
FROM website_sessions  
WHERE website_session_id BETWEEN 100000 AND 115000
GROUP BY year,week

 * mysql+mysqlconnector://root:***@localhost:3306/mavenfuzzyfactory
9 rows affected.

   year  week  week_start  session
0  2013    22  2013-06-05      883
1  2013    23  2013-06-09     1920
2  2013    24  2013-06-16     2066
3  2013    25  2013-06-23     2027
4  2013    26  2013-06-30     1919
5  2013    27  2013-07-07     1938
6  2013    28  2013-07-14     2007
7  2013    29  2013-07-21     2052
8  2013    30  2013-07-28      189

#### **# USE OF `COUNT` IN CONJOINT WITH THE `CASE` CLAUSE**

In [22]:
%%sql   
SELECT 
    primary_product_id,
    COUNT(DISTINCT CASE 
          WHEN items_purchased = 1 THEN order_id
          ELSE NULL 
          END) as single_item_orders, 
    COUNT(DISTINCT CASE 
          WHEN items_purchased = 2 THEN order_id
          ELSE NULL 
          END) as two_item_orders 
FROM orders 
WHERE order_id BETWEEN 31000 AND 32000
GROUP BY primary_product_id

 * mysql+mysqlconnector://root:***@localhost:3306/mavenfuzzyfactory
4 rows affected.

   primary_product_id  single_item_orders  two_item_orders
0                   1                 406              256
1                   2                  99               38
2                   3                  73               44
3                   4                  75               10

#### **# USE OF `SUM` IN CONJOINT WITH THE `CASE` CLAUSE**

In [23]:
%%sql    
SELECT 
    primary_product_id,
    SUM(CASE 
        WHEN items_purchased = 1 THEN 1 
        ELSE 0 END) as count_single_item,
    SUM(CASE 
        WHEN items_purchased = 2 THEN 1 
        ELSE 0 END) as count_two_item
FROM orders
WHERE order_id BETWEEN 31000 AND 32000
GROUP BY primary_product_id

 * mysql+mysqlconnector://root:***@localhost:3306/mavenfuzzyfactory
4 rows affected.

   primary_product_id count_single_item count_two_item
0                   1               406            256
1                   3                73             44
2                   2                99             38
3                   4                75             10

<hr>
<h4><b>MONITORING THE BID DOWN MADE</b></h4>
<img src="assets/ass-03.png" width="400" height="300">
<hr>

In [24]:
%%sql   
SELECT 
    MIN(DATE(created_at)) as week_start,
    COUNT(DISTINCT website_session_id) as session
FROM website_sessions 
WHERE created_at < '2012-05-12' 
    AND utm_source = 'gsearch' 
    AND utm_campaign = 'nonbrand'
GROUP BY 
    YEAR(created_at),
    WEEK(created_at);

 * mysql+mysqlconnector://root:***@localhost:3306/mavenfuzzyfactory
8 rows affected.

   week_start  session
0  2012-03-19      896
1  2012-03-25      956
2  2012-04-01     1152
3  2012-04-08      983
4  2012-04-15      621
5  2012-04-22      594
6  2012-04-29      681
7  2012-05-06      651

<hr>
<h4><b>TRAFFIC SOURCE BID OPTIMIZATION</b></h4>
<img src="assets/ass-04.png" width="400" height="300">
<hr>

In [36]:
%%sql     # CVR broken down by device type 
SELECT
    device_type,
    COUNT(DISTINCT W.website_session_id) AS sessions, 
    COUNT(DISTINCT O.order_id) AS orders, 
    COUNT(DISTINCT O.order_id)/COUNT(DISTINCT W.website_session_id)*100 AS conversion_rate
FROM website_sessions W
    LEFT JOIN orders O 
        ON O.website_session_id = W.website_session_id
WHERE W.created_at < '2012-05-11' AND 
    W.utm_source = 'gsearch' AND
    W.utm_campaign = 'nonbrand'
    
GROUP BY 
    device_type;

 * mysql+mysqlconnector://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

  device_type  sessions  orders conversion_rate
0     desktop      3911     146          3.7331
1      mobile      2492      24          0.9631

<hr>
<h4><b>TRAFFIC SOURCE SEGMENT TRENDING</b></h4>
<img src="assets/ass-05.png" width="400" height="300">
<hr>

In [46]:
%%sql
SELECT 
    MIN(DATE(created_at)) as week_start,
    COUNT(DISTINCT website_session_id) as total_session,
    SUM(CASE WHEN device_type = 'desktop' THEN 1 
        ELSE 0 END) as desktop_session,
    SUM(CASE WHEN device_type = 'mobile' THEN 1 
        ELSE 0 END) as mobile_session,
    SUM(CASE WHEN device_type = 'desktop' THEN 1 
        ELSE 0 END) / COUNT(DISTINCT website_session_id)*100 AS 'desktop session %',
    SUM(CASE WHEN device_type = 'mobile' THEN 1 
        ELSE 0 END) / COUNT(DISTINCT website_session_id)*100 AS 'mobile session %' 
FROM website_sessions
WHERE created_at > '2012-04-15' 
    AND utm_source = 'gsearch' 
    AND utm_campaign = 'nonbrand'
GROUP BY
    YEAR(created_at),
    WEEK(created_at);

 * mysql+mysqlconnector://root:***@localhost:3306/mavenfuzzyfactory
162 rows affected.

,week_start,total_session,desktop_session,mobile_session,desktop session %,mobile session %
0,2012-04-15,621,383,238,61.6747,38.3253
1,2012-04-22,594,360,234,60.6061,39.3939
2,2012-04-29,681,425,256,62.4082,37.5918
3,2012-05-06,712,430,282,60.3933,39.6067
4,2012-05-13,617,403,214,65.3160,34.6840
5,2012-05-20,851,661,190,77.6733,22.3267
6,2012-05-27,768,585,183,76.1719,23.8281
7,2012-06-03,792,625,167,78.9141,21.0859
8,2012-06-10,875,689,186,78.7429,21.2571
9,2012-06-17,842,647,195,76.8409,23.1591
10,2012-06-24,755,582,173,77.0861,22.9139
11,2012-07-01,780,599,181,76.7949,23.2051
12,2012-07-08,801,596,205,74.4070,25.5930
13,2012-07-15,850,647,203,76.1176,23.8824
14,2012-07-22,796,624,172,78.3920,21.6080
15,2012-07-29,1028,748,280,72.7626,27.2374
16,2012-08-05,1087,835,252,76.8169,23.1831
17,2012-08-12,998,730,268,73.1463,26.8537
18,2012-08-19,1012,771,241,76.1858,23.8142
19,2012-08-26,1056,793,263,75.0947,24.9053

<h3><b>ANALYZING WEBSITE PERFORMANCE</b></h3> 

### Analyzing the website `logs` to understand which content has been visited the most by users to finally shift focus on what visitors are really interested in. As we have several pages, we are interested to know, in a given time period, how many visitors have come to visit each and every page by counting the sessions.

### Key Tables:
`website_pageviews` ; 
`orders`

#### **# USING TEMPORARY TABLES TO PERFORM `MULTI-STEP ANALYSIS`**

In [50]:
%%sql   # Top content 
SELECT 
    pageview_url,
    COUNT(DISTINCT website_pageview_id) AS page_view_count
FROM website_pageviews
GROUP BY pageview_url
ORDER BY page_view_count DESC

 * mysql+mysqlconnector://root:***@localhost:3306/mavenfuzzyfactory
16 rows affected.

                   pageview_url  page_view_count
0                     /products           261231
1        /the-original-mr-fuzzy           162525
2                         /home           137576
3                     /lander-2           131170
4                         /cart            94953
5                     /lander-3            79000
6                     /lander-5            68166
7                     /shipping            64484
8                    /billing-2            48441
9                     /lander-1            47574
10    /thank-you-for-your-order            32313
11       /the-forever-love-bear            26033
12    /the-birthday-sugar-panda            19046
13                    /lander-4             9385
14                     /billing             3617
15  /the-hudson-river-mini-bear             2610

In [51]:
%%sql   # Top entry pages 
SELECT *
FROM website_pageviews

 * mysql+mysqlconnector://root:***@localhost:3306/mavenfuzzyfactory
1188124 rows affected.

,website_pageview_id,created_at,website_session_id,pageview_url
0,1,2012-03-19 08:04:16,1,/home
1,2,2012-03-19 08:16:49,2,/home
2,3,2012-03-19 08:26:55,3,/home
3,4,2012-03-19 08:37:33,4,/home
4,5,2012-03-19 09:00:55,5,/home
5,6,2012-03-19 09:05:46,6,/home
6,7,2012-03-19 09:06:27,7,/home
7,8,2012-03-19 09:10:08,6,/products
8,9,2012-03-19 09:10:52,6,/the-original-mr-fuzzy
9,10,2012-03-19 09:14:02,6,/cart
10,11,2012-03-19 09:16:52,6,/shipping
11,12,2012-03-19 09:17:17,8,/home
12,13,2012-03-19 09:19:52,6,/billing
13,14,2012-03-19 09:27:56,9,/home
14,15,2012-03-19 09:35:37,10,/home
15,16,2012-03-19 09:37:42,11,/home
16,17,2012-03-19 09:39:57,12,/home
17,18,2012-03-19 09:45:29,13,/home
18,19,2012-03-19 09:45:47,14,/home
19,20,2012-03-19 09:57:14,15,/home

In [14]:
%%sql 
SELECT *
FROM website_sessions

 * mysql+mysqlconnector://root:***@localhost:3306/mavenfuzzyfactory
472871 rows affected.

,website_session_id,created_at,user_id,is_repeat_session,utm_source,utm_campaign,utm_content,device_type,http_referer
0,1,2012-03-19 08:04:16,1,0,gsearch,nonbrand,g_ad_1,mobile,https://www.gsearch.com
1,2,2012-03-19 08:16:49,2,0,gsearch,nonbrand,g_ad_1,desktop,https://www.gsearch.com
2,3,2012-03-19 08:26:55,3,0,gsearch,nonbrand,g_ad_1,desktop,https://www.gsearch.com
3,4,2012-03-19 08:37:33,4,0,gsearch,nonbrand,g_ad_1,desktop,https://www.gsearch.com
4,5,2012-03-19 09:00:55,5,0,gsearch,nonbrand,g_ad_1,mobile,https://www.gsearch.com
5,6,2012-03-19 09:05:46,6,0,gsearch,nonbrand,g_ad_1,desktop,https://www.gsearch.com
6,7,2012-03-19 09:06:27,7,0,gsearch,nonbrand,g_ad_1,mobile,https://www.gsearch.com
7,8,2012-03-19 09:17:17,8,0,gsearch,nonbrand,g_ad_1,mobile,https://www.gsearch.com
8,9,2012-03-19 09:27:56,9,0,gsearch,nonbrand,g_ad_1,mobile,https://www.gsearch.com
9,10,2012-03-19 09:35:37,10,0,gsearch,nonbrand,g_ad_1,mobile,https://www.gsearch.com
10,11,2012-03-19 09:37:42,11,0,gsearch,nonbrand,g_ad_1,mobile,https://www.gsearch.com
11,12,2012-03-19 09:39:57,12,0,gsearch,nonbrand,g_ad_1,mobile,https://www.gsearch.com
12,13,2012-03-19 09:45:29,13,0,gsearch,nonbrand,g_ad_1,desktop,https://www.gsearch.com
13,14,2012-03-19 09:45:47,14,0,gsearch,nonbrand,g_ad_1,mobile,https://www.gsearch.com
14,15,2012-03-19 09:57:14,15,0,gsearch,nonbrand,g_ad_1,desktop,https://www.gsearch.com
15,16,2012-03-19 10:01:35,16,0,gsearch,nonbrand,g_ad_1,mobile,https://www.gsearch.com
16,17,2012-03-19 10:14:34,17,0,gsearch,nonbrand,g_ad_1,desktop,https://www.gsearch.com
17,18,2012-03-19 10:16:57,18,0,gsearch,nonbrand,g_ad_1,desktop,https://www.gsearch.com
18,19,2012-03-19 10:17:38,19,0,gsearch,nonbrand,g_ad_1,mobile,https://www.gsearch.com
19,20,2012-03-19 10:22:58,20,0,gsearch,nonbrand,g_ad_1,desktop,https://www.gsearch.com

<h3><b>ANALYZING WEBSITE PERFORMANCE</b></h3> 

#### Analyzing the website `logs` to understand which content has been visited the most by users to finally shift focus on what visitors are really interested in. As we have several pages, we are interested to know, in a given time period, how many visitors have come to visit each and every page by counting the sessions.

#### Key Tables:
`website_sessions` ; 
`website_pageviews` ;
`orders`

In [15]:
%%sql

SELECT 
    CASE
        WHEN product_type = 1 THEN 'mrfuzzy'
        WHEN product_type = 2 THEN 'lovebear'
        ELSE 'error, check again'
    END AS product_seen,
    SUM(to_cart)/COUNT(product_type) AS add_to_cart_click_rate,
    SUM(to_shipping)/SUM(to_cart) AS shipping_click_rate,
    SUM(to_billing)/SUM(to_shipping) AS billing_click_rate,
    SUM(to_thank_you)/SUM(to_billing) AS order_click_rate
FROM (SELECT
    website_pageviews.website_session_id AS sessions,
    MAX(CASE
        WHEN pageview_url = '/the-original-mr-fuzzy' THEN 1
        WHEN pageview_url = '/the-forever-love-bear' THEN 2
        ELSE NULL
    END) AS product_type,
    MAX(CASE WHEN pageview_url = '/cart' THEN 1 ELSE 0 END) AS to_cart,
    MAX(CASE WHEN pageview_url = '/shipping' THEN 1 ELSE 0 END) AS to_shipping,
    MAX(CASE WHEN pageview_url = '/billing-2' THEN 1 ELSE 0 END) AS to_billing,
    MAX(CASE WHEN pageview_url = '/thank-you-for-your-order' THEN 1 ELSE 0 END) AS to_thank_you
    FROM website_pageviews
    WHERE created_at < '2013-04-10' AND created_at > '2013-01-06'
    GROUP BY sessions) AS conv_funnel
WHERE product_type IN (1,2)
GROUP BY product_type;

 * mysql+mysqlconnector://root:***@localhost:3306/mavenfuzzyfactory
2 rows affected.

,product_seen,add_to_cart_click_rate,shipping_click_rate,billing_click_rate,order_click_rate
0,mrfuzzy,0.4349,0.6860,0.8205,0.6363
1,lovebear,0.5485,0.6876,0.8093,0.6168

In [16]:
#Get the result set per chunk of size 20 
# query = '''
# SELECT * FROM website_sessions
# '''
# df = pd.read_sql_query(query, engine, chunksize=20)
# df.__next__()